{
    "article_link": "",
    "article_tags": "f1",
    "article_text": "As the Formula 1 circus rolls into Bahrain for the fourth race of the 2025 season, the drivers have found a new way to unwind before the high-speed action kicks off: a spontaneous karaoke showdown in the paddock. Forget tire strategies and qualifying sims—last night, it was all about who could belt out the best tunes, and let's just say some of these racers might want to stick to their day jobs.\n\nIt all started when McLaren's Lando Norris challenged Max Verstappen to a sing-off after a particularly heated debate about who ate the last slice of pizza in the drivers' lounge. Armed with a portable speaker and a questionable playlist, Norris kicked things off with a surprisingly solid rendition of Sweet Caroline, complete with dramatic arm waves that had the pit crew in stitches.\n\nVerstappen, never one to back down, countered with a gravelly take on Bohemian Rhapsody. \"I don't need a steering wheel to hit the high notes,\" the Red Bull ace quipped, though his attempt at Freddie Mercury's falsetto left rookie teammate Yuki Tsunoda doubled over laughing. Tsunoda, in turn, stole the show with a pitch-perfect Gangnam Style, dance moves included—proving he's got more rhythm off the track than on it.\n\nFerrari's Lewis Hamilton, fresh off a Sprint win in China earlier this season, opted for a chill vibe with Bob Marley's Three Little Birds. \"No stress, just good energy,\" Hamilton said, grinning as he handed the mic to Charles Leclerc, who bravely tackled My Heart Will Go On. The less said about Leclerc's Celine Dion impression, the better—though the crowd's cheers suggested they appreciated the effort.\n\nEven the usually stoic Mercedes rookie Andrea Kimi Antonelli got in on the fun, mumbling through Wonderwall while George Russell provided unsolicited backup vocals. \"I think we've found our new team bonding exercise,\" Russell joked, dodging a playful shove from Antonelli.\n\nThe impromptu session wrapped up with Haas's Ollie Bearman leading a group chant of Sweet Home Alabama, uniting drivers and mechanics alike in a rare moment of pre-race silliness. Team principals, watching from the sidelines, couldn't help but crack a smile—though McLaren's Andrea Stella was overheard muttering, \"I hope they save some of that energy for quali.\"\n\nWith the Bahrain Grand Prix weekend about to heat up, this laid-back karaoke night might just be the breather the grid needed before the triple-header grind continues. No word yet on whether Norris plans to add \"karaoke champ\" to his growing list of 2025 achievements, but one thing's clear: these drivers know how to have a laugh when the helmets are off.",
    "article_title": "f1 kareoke"
}